let workRule = 'Зарим хүмүүс Ажлыг дүрмийг зөвхөн GOOGLE-ийн талаарх ном гэж бодож байж магад.Энэ үнэн,гэхдээ үүгээр зогсохгүй энэ бол ямар ч байгууллага ажилчдаасаа хйимгийн ухаалаг шийдвэрүүдийг гаргуулж байх тогтолцоог хэрхэн бий болгох талаарх ном юм.Ажлын дүрэм! ном нь бодит туршлага дээр суурилсан гарын авлага төдийгүй маргашгүй зарчмууд нв албан ажлын ертөнцийг захирах нь дамжиггүй биз ээ. - Жеффи Пеффер';
let overUsedWords = ['ном','энэ'];
let weakWords = ['нь','юм','гэж'];
// alham1: workRule хувьсагчид агуулагдаж буй текстийн үг биртэй ажиллах тул workRuleWords нэртэй массивд үгнүүдийг салгаж хадгал
// alham2:Массивд хэдэн үг байгааг консол дээр харуулна
// alham3:Одоо текстэд агуулагдаж байгаа үгсээс weakWords массивд байгаа үгсийг хасъя.Хасахдаа FileSystemEntry() болон includes() аргуудыг ашиглаарай
// Үлдсэн үгсийг betterWords массивд хадгалж харуулна
// alham4 overUsedWords массивд хадгалагдаж буй үгс текст дотор хэдэн удаа давтагдаж байгааг тоолно Тоолохдоо foreach() арга ба давтагдсан тоог хадгалах countNom countEne хувьсагчийг ашигла .Тоологдсон утгыг консол дээр ES6 Тэмдэгт мөр залгах бичиглэлээр бичнэ
// 'Ном' үгийн тоо:?
// "Энэ " үгийн тоо:?
// alham5: Одоо хэдэн өгүүлбэр энэ текстэд орсныг тоолно Өгүүлбэрийн төгсгөл цэгийг анхаарах ба мөн өгүүлбэрийн тоог хадгалах sentenceCount хувьсагыийг зарлаарай.alham5
// 'Өгүүлбэрийн тоо':?